src/Catalogs/Коммиты/Коммиты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Коммиты</name>
  <owners>Catalog.Проекты</owners>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Ветка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИзмененныеФайлы</name>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяМетаданных</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Коммиты/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ОбновитьСписокФайлов(Команда)
	//chcp 65001 && git show --name-only 15e3f96d9bd3351b020b138d532a3337d4e1913a > C:\tmp\1.txt
	Объект.ИзмененныеФайлы.Очистить();
	
	Файлы = РаботаСГитомКлиентСервер.ПолучитьСписокИзменений(Объект.Владелец, Объект.Идентификатор);
	СоответствиеПапкаМетаданные = РаботаСГитомКлиентСервер.ПолучитьСоответствияМетаданныхПапкам();
	
	Для Каждого СтрокаФайла Из Файлы Цикл
		НоваяСтрока = Объект.ИзмененныеФайлы.Добавить();
		НоваяСтрока.ИмяФайла = СтрокаФайла.ИмяФайла;
		
		ОписаниеМета = РаботаСГитомКлиентСервер.РазобратьСтрокуНаМетаданные(СтрокаФайла.ИмяФайла, СоответствиеПапкаМетаданные);
		НоваяСтрока.ИмяМетаданных = ОписаниеМета.ПолныйПутьКМетаданному;
	КонецЦикла;
	
КонецПроцедуры
